Revit 2026 API

# WaveWaveAmplitude Property

---

The property labeled "Amplitude" from the "Wave" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WaveAmplitude { get; }
```
```vb
Public Shared ReadOnly Property WaveAmplitude As String
	Get
```
```cpp
public:
static property String^ WaveAmplitude {
	String^ get ();
}
```
```fsharp
static member WaveAmplitude : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 10000".

#### Reference

Wave Class

Autodesk.Revit.DB.Visual Namespace